lab11/nrf5x-base/lib/simple_ble/simple_ble.c
/*******************************************************************************
 *   INIT FUNCTIONS
 ******************************************************************************/

// Configure the MAC address of the device based on the config values and what is stored in the flash.
void __attribute__((weak)) ble_address_set(void) {
    uint32_t err_code;

    // Set the MAC address of the device
    // Highest priority is address from flash if available
    // Next is is the address supplied by user in ble_config
    // Finally, Nordic assigned random value is used as last choice
    ble_gap_addr_t gap_addr = {.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC};

    // Default is a combination of Michigan OUI and Platform ID
    uint8_t new_ble_addr[6] = {0x00, 0x00, ble_config->platform_id, 0xe5, 0x98, 0xc0};
    memcpy(gap_addr.addr, new_ble_addr, 6);

    if (ble_config->device_id != DEVICE_ID_DEFAULT) {
        new_ble_addr[0] = ble_config->device_id & 0xFF;
        new_ble_addr[1] = (ble_config->device_id >> 8) & 0xFF;
        memcpy(gap_addr.addr, new_ble_addr, sizeof(gap_addr.addr));
    } else {

    // get BLE address from Flash
#ifdef BLE_FLASH_ADDRESS
        uint8_t* _ble_address = (uint8_t*)BLE_FLASH_ADDRESS;
        if (_ble_address[1] == 0xFF && _ble_address[0] == 0xFF) {
            // No user-defined address stored in flash

            // Check if we should use the Nordic assigned random value for the
            // lower two bytes or use a user configured value.
            if (ble_config->device_id != DEVICE_ID_DEFAULT) {
                new_ble_addr[0] = ble_config->device_id & 0xFF;
                new_ble_addr[1] = (ble_config->device_id >> 8) & 0xFF;
                memcpy(gap_addr.addr, new_ble_addr, sizeof(gap_addr.addr));

            } else {
                // Set the new BLE address with the Michigan OUI, Platform ID, and
                //  bottom two octets from the original gap address
                // Get the current original address
                sd_ble_gap_addr_get(&gap_addr);
                memcpy(gap_addr.addr+2, new_ble_addr+2, sizeof(gap_addr.addr)-2);
            }
        } else {
            // User-defined address stored in flash

            // Set the new BLE address with the user-defined address
            memcpy(gap_addr.addr, _ble_address, 6);
        }
#endif

// If defined either over command line, in makefile or directly in ble_config.h
#ifdef BLE_ADDRESS
#define XID_STR(ID) ID_STR(ID)
#define ID_STR(ID) #ID
#define BLE_ADDRESS_LENGTH 6

        const char ble_address_string[] = XID_STR(BLE_ADDRESS);
        for (int i=0; i < BLE_ADDRESS_LENGTH; i++) {
            // For each 8bits, read the string and convert it from hex to a long; store it in LSB-first order
            ble_address[(BLE_ADDRESS_LENGTH-1) - i] = (uint8_t)strtoul(&ble_address_string[3*i], NULL, 16);
        }

        printf("Bluetooth address: %02x:%02x:%02x:%02x:%02x:%02x\n", ble_address[5], ble_address[4], ble_address[3], ble_address[2], ble_address[1], ble_address[0]);
        memcpy(gap_addr.addr, ble_address, BLE_ADDRESS_LENGTH);
#endif

#ifdef ENABLE_DFU
        // Write ble address to memory to share with bootloader
        memcpy((uint8_t*)BOOTLOADER_BLE_ADDR_START, gap_addr.addr, 6);
#endif
    }

    err_code = sd_ble_gap_addr_set(&gap_addr);
    APP_ERROR_CHECK(err_code);
}

// Init the crystal and SoftDevice, plus configure the device address
void __attribute__((weak)) ble_stack_init(void) {
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_app_ram_start_get(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Overwrite some of the default configurations for the BLE stack.
    ble_cfg_t ble_cfg;

    // Configure the maximum number of connections.
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag                     = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count   = NRF_SDH_BLE_TOTAL_LINK_COUNT;
    ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = NRF_SDH_BLE_GAP_EVENT_LENGTH;
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure the connection roles
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.gap_cfg.role_count_cfg.periph_role_count  = 1;
    ble_cfg.gap_cfg.role_count_cfg.central_role_count = 0;
    ble_cfg.gap_cfg.role_count_cfg.central_sec_count  = 0;
    err_code = sd_ble_cfg_set(BLE_GAP_CFG_ROLE_COUNT, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure max ATT MTU size
    memset(&ble_cfg, 0x00, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag                 = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure number of custom UUIDS.
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.common_cfg.vs_uuid_cfg.vs_uuid_count = NRF_SDH_BLE_VS_UUID_COUNT;
    err_code = sd_ble_cfg_set(BLE_COMMON_CFG_VS_UUID, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure the GATTS attribute table.
    memset(&ble_cfg, 0x00, sizeof(ble_cfg));
    ble_cfg.gatts_cfg.attr_tab_size.attr_tab_size = NRF_SDH_BLE_GATTS_ATTR_TAB_SIZE;
    err_code = sd_ble_cfg_set(BLE_GATTS_CFG_ATTR_TAB_SIZE, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure Service Changed characteristic.
    memset(&ble_cfg, 0x00, sizeof(ble_cfg));
    ble_cfg.gatts_cfg.service_changed.service_changed = NRF_SDH_BLE_SERVICE_CHANGED;
    err_code = sd_ble_cfg_set(BLE_GATTS_CFG_SERVICE_CHANGED, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);


    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, on_ble_evt, NULL);

    // And set the address in the init phase
    ble_address_set();
}

