lab11/nrf5x-base/lib/simple_ble/simple_ble.c
// GAP initialization: set up all the necessary GAP (Generic Access Profile) parameters of the device. It also sets the permissions and appearance
void __attribute__((weak)) gap_params_init(void) {
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    // Full strength signal
    #define TX_POWER_0DBM 0
    sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle, TX_POWER_0DBM);

    // Let anyone connect and set the name given the platform
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)ble_config->adv_name, strlen(ble_config->adv_name));
    APP_ERROR_CHECK(err_code);

    // Display default generic HID symbol when connected to other devices (e.g. Android, Windows)
    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_HID);
    APP_ERROR_CHECK(err_code);

    // Connection parameters
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = ble_config->min_conn_interval;
    gap_conn_params.max_conn_interval = ble_config->max_conn_interval;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

// Initializing the GATT module.
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) advertising_init(void) {

    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    // Custom advertisement data
    /*ble_advdata_manuf_data_t             manuf_data_adv;
    #define MANUF_ADV_LENGTH             8
    uint8_t data_adv[MANUF_ADV_LENGTH]   = {0};
    data_adv[0]                          = APP_SERVICE_ID; // TotTag's service identifier, expected to be first byte of advertisement
    manuf_data_adv.company_identifier    = APP_COMPANY_IDENTIFIER; // UMich's Company ID
    manuf_data_adv.data.p_data           = data_adv;
    manuf_data_adv.data.size             = sizeof(data_adv);
    init.advdata.p_manuf_specific_data   = &manuf_data_adv;*/

    // General Advertisement settings

    // Add device name in advertisements
    // init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    // For shorter names, adjust as follows. The full name will still be displayed in connections
    init.advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
    init.advdata.short_name_len          = 4; // Advertise the first X letters of the name

    // Set Advertisement setting
    init.advdata.include_appearance      = false;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    //init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    //init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    // Scan response
    /*ble_advdata_manuf_data_t             manuf_data_resp;
    #define MANUF_RESP_LENGTH            20
    uint8_t data_resp[MANUF_RESP_LENGTH] = {0};
    manuf_data_resp.company_identifier   = APP_COMPANY_IDENTIFIER;
    manuf_data_resp.data.p_data          = data_resp;
    manuf_data_resp.data.size            = sizeof(data_resp);
    init.srdata.p_manuf_specific_data    = &manuf_data_resp;*/
    init.srdata.name_type                = BLE_ADVDATA_FULL_NAME;
    //init.srdata.uuids_complete.uuid_cnt  = sizeof(m_sr_uuids) / sizeof(m_sr_uuids[0]);
    //init.srdata.uuids_complete.p_uuids   = m_sr_uuids;

    // Configure advertisements
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = ble_config->adv_interval;
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
    init.config.ble_adv_whitelist_enabled = false; // equivalent with BLE_GAP_ADV_FP_ANY

    // Define Event handler
    init.evt_handler = m_advertising.evt_handler;

    // Setup advertisement settings for future resets (see advertisement_start)
    memset(&m_advertising.adv_params, 0, sizeof(m_advertising.adv_params));
    m_advertising.adv_params.interval        = ble_config->adv_interval;
    m_advertising.adv_params.duration        = APP_ADV_TIMEOUT_IN_SECONDS; // 0 : Never time out
    m_advertising.adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
    m_advertising.adv_params.p_peer_addr     = NULL; // Undirected advertisement
    m_advertising.adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

void __attribute__((weak)) conn_params_init(void) {
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    // Setup connection parameter negotiation
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false; // Uses on_conn_params_evt as an event handler
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) services_init(void) {
}

#ifdef ENABLE_DFU
void __attribute__((weak)) dfu_init (void) {

    simple_ble_add_service(&dfu_service);
    // Add ctrl pt characteristic
    simple_ble_add_characteristic(0,1,1,1,
        BLE_L2CAP_MTU_DEF, NULL,
        &dfu_service,&dfu_ctrlpt_char);
}

void __attribute__((weak)) dfu_reset_prepare (void) {
}

void dfu_reset() {
    int err_code = 0;

    // set flag for bootloader to enter dfu
    err_code = sd_power_gpregret_clr(0xFF);
    APP_ERROR_CHECK(err_code);
    err_code = sd_power_gpregret_set(BOOTLOADER_DFU_START);
    APP_ERROR_CHECK(err_code);

