lab11/nrf5x-base/lib/simple_ble/simple_ble.c
    dfu_reset_prepare();
    err_code = sd_softdevice_disable();
    APP_ERROR_CHECK(err_code);

    err_code = sd_softdevice_vector_table_base_set(NRF_UICR->BOOTLOADERADDR);
    APP_ERROR_CHECK(err_code);

    NVIC_ClearPendingIRQ(SWI2_IRQn);
    interrupts_disable();
    bootloader_util_app_start(NRF_UICR->BOOTLOADERADDR);
}
#endif

void __attribute__((weak)) initialize_app_timer (void) {

    // Init application timer module
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/*******************************************************************************
 *   HELPER FUNCTIONS
 ******************************************************************************/
void __attribute__((weak)) advertising_start(void) {

    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

    if (err_code != NRF_ERROR_INVALID_STATE) {
        // Ignore Invalid State responses. Occurs when start is called twice
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) advertising_stop(void) {

    uint32_t err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);

    if (err_code != NRF_ERROR_INVALID_STATE) {
        // Ignore Invalid State responses. Occurs when stop is called although advertising is not running
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) scanning_start(void) {
    static ble_gap_scan_params_t m_scan_params = {
        .active            = false, // passive scanning (no scan response)
        .interval          = MSEC_TO_UNITS(100, UNIT_0_625_MS), // interval 100 ms
        .window            = MSEC_TO_UNITS(100, UNIT_0_625_MS), // window 100 ms
        .timeout           = BLE_GAP_SCAN_TIMEOUT_UNLIMITED,
        .scan_phys         = BLE_GAP_PHY_1MBPS,
        .filter_policy     = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    };

    ret_code_t err_code = sd_ble_gap_scan_start(&m_scan_params, &m_scan_buffer);
    APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) power_manage(void) {

    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*******************************************************************************
 *   SIMPLE BLE API
 ******************************************************************************/

simple_ble_app_t* simple_ble_init(const simple_ble_config_t* conf) {
    ble_config = conf;

    // Setup BLE and services
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();

    // Create device information service
#if defined(HW_REVISION) || defined(FW_REVISION)
    simple_ble_device_info_service_automatic();
#endif

    // Enable device firmware updates
#ifdef ENABLE_DFU
    dfu_init();
#endif

    // APP_TIMER_INIT must be called before conn_params_init since it uses timers
    initialize_app_timer();
    conn_params_init();

    // Initialize our connection state to "not in a connection"
    app.conn_handle = BLE_CONN_HANDLE_INVALID;

    // Return a reference to the application state so that the user of this
    // module has a pointer to the connection handle.
    return &app;
}

void simple_ble_add_service(simple_ble_service_t* service_handle) {
    uint32_t err_code;

    // Setup our long UUID so that nRF recognizes it. This is done by storing
    // the full 128-bit UUID and using 16 bits of it as a handle
    uint16_t uuid16 = (service_handle->uuid128.uuid128[12] << 8) |(service_handle->uuid128.uuid128[13]);
    if (!service_handle->uuid_handle.uuid) {
        service_handle->uuid_handle.uuid = uuid16;
    }
    err_code = sd_ble_uuid_vs_add(&(service_handle->uuid128), &(service_handle->uuid_handle.type));
    APP_ERROR_CHECK(err_code);

    // Add the custom service to the system
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &(service_handle->uuid_handle), &(service_handle->service_handle));
    APP_ERROR_CHECK(err_code);
}

void simple_ble_add_characteristic(uint8_t read, uint8_t write, uint8_t notify, uint8_t vlen,
                                   uint16_t len, uint8_t* buf,
                                   simple_ble_service_t* service_handle,
                                   simple_ble_char_t* char_handle) {
    ret_code_t err_code;

    // Set characteristic UUID & add it
    ble_uuid_t char_uuid;
    char_uuid.type = service_handle->uuid_handle.type;
    char_uuid.uuid = char_handle->uuid16;

    err_code = sd_ble_uuid_vs_add(&service_handle->uuid128, &char_uuid.type);
    APP_ERROR_CHECK(err_code);

    // Set characteristic metadata
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read   = read;
    char_md.char_props.write  = write;
    char_md.char_props.notify = notify;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = NULL;
    char_md.p_sccd_md         = NULL;

    // Configuring Client Characteristic Configuration Descriptor (CCCD) metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc      = BLE_GATTS_VLOC_STACK;
    char_md.p_cccd_md = &cccd_md;

    // Set attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md));
    if (read) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    if (write) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    attr_md.vloc    = BLE_GATTS_VLOC_USER;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = vlen;

    // Set attribute data
    ble_gatts_attr_t attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid    = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = len; // max len can be up to BLE_GATTS_FIX_ATTR_LEN_MAX (510)
    attr_char_value.p_value   = buf;

